; domain
(define (domain BLOCKS2)
    (:requirements :strips :typing)
    (:types block slot)
    (:predicates 
            ; Straightforward
            (handempty)
            (gridempty)
            (holding ?x - block)
            (unused ?x - block)
            
            ; Slot X is "__" of slot Y
            ; These are STATIC and should NEVER change
            (east ?x - slot ?y - slot)
            (north ?x - slot ?y - slot)
            (northeast ?x - slot ?y - slot)

            ; Slot is empty or filled
            (empty ?x - slot)
            (filled ?x - slot)

            ; Block B is in Slot S (1 block per slot max)
            (in ?b - block ?s - slot)
            )

    (:action pick-up
        :parameters (?x - block)
        :precondition (and 
            (handempty)
            (unused ?x))
        :effect (and 
            (not (handempty))
            (holding ?x))
    )

    ; Place block B north of block BREF
    ; slot arguments are pddl internal used to check if we can place a block there
    (:action place-north
        :parameters (?b - block ?bref - block ?s - slot ?sref - slot)
        :precondition (and 
            (holding ?b)
            (unused ?b)
            (filled ?sref)
            (empty ?s)
            (north ?s ?sref)
            (in ?bref ?sref))
        :effect (and 
            (not (holding ?b))
            (handempty)
            (not (unused ?b))
            (not (empty ?s))
            (filled ?s)
            (in ?b ?s))
    )

    ; Place block B south of block BREF 
    ; Checks that SREF is north of S to accomplish this more simply
    (:action place-south
        :parameters (?b - block ?bref - block ?s - slot ?sref - slot)
        :precondition (and 
            (holding ?b)
            (unused ?b)
            (filled ?sref)
            (empty ?s)
            (north ?sref ?s)
            (in ?bref ?sref))
        :effect (and 
            (not (holding ?b))
            (handempty)
            (not (unused ?b))
            (not (empty ?s))
            (filled ?s)
            (in ?b ?s))
    )

    ; Place block B north of block BREF
    ; slot arguments are pddl internal used to check if we can place a block there
    (:action place-east
        :parameters (?b - block ?bref - block ?s - slot ?sref - slot)
        :precondition (and 
            (holding ?b)
            (unused ?b)
            (filled ?sref)
            (empty ?s)
            (east ?s ?sref)
            (in ?bref ?sref))
        :effect (and 
            (not (holding ?b))
            (handempty)
            (not (unused ?b))
            (not (empty ?s))
            (filled ?s)
            (in ?b ?s))
    )

    ; Place block B south of block BREF 
    ; Checks that SREF is north of S to accomplish this more simply
    (:action place-west
        :parameters (?b - block ?bref - block ?s - slot ?sref - slot)
        :precondition (and 
            (holding ?b)
            (unused ?b)
            (filled ?sref)
            (empty ?s)
            (east ?sref ?s)
            (in ?bref ?sref))
        :effect (and 
            (not (holding ?b))
            (handempty)
            (not (unused ?b))
            (not (empty ?s))
            (filled ?s)
            (in ?b ?s))
    )

    ; Place block B north of block BREF
    ; slot arguments are pddl internal used to check if we can place a block there
    (:action place-northeast
        :parameters (?b - block ?bref - block ?s - slot ?sref - slot)
        :precondition (and 
            (holding ?b)
            (unused ?b)
            (filled ?sref)
            (empty ?s)
            (northeast ?s ?sref)
            (in ?bref ?sref))
        :effect (and 
            (not (holding ?b))
            (handempty)
            (not (unused ?b))
            (not (empty ?s))
            (filled ?s)
            (in ?b ?s))
    )

    ; Place block B south of block BREF 
    ; Checks that SREF is north of S to accomplish this more simply
    (:action place-southwest
        :parameters (?b - block ?bref - block ?s - slot ?sref - slot)
        :precondition (and 
            (holding ?b)
            (unused ?b)
            (filled ?sref)
            (empty ?s)
            (northeast ?sref ?s)
            (in ?bref ?sref))
        :effect (and 
            (not (holding ?b))
            (handempty)
            (not (unused ?b))
            (not (empty ?s))
            (filled ?s)
            (in ?b ?s))
    )

    ; Place the first block into a slot
    (:action place-first
        :parameters (?b - block ?s - slot)
        :precondition (and 
            (holding ?b)
            (gridempty)
            (unused ?b)
            (empty ?s))
        :effect (and 
            (not (gridempty))
            (not (unused ?b))
            (not (empty ?s))
            (filled ?s)
            (handempty)
            (not (holding ?b))
            (in ?b ?s))
    )
)

; problem
(define (problem BLOCKS_PROBLEM)
(:domain BLOCKS2)
(:objects b1 b2 b3 b4 b5 b6 - block
          s1 s2 s3 s4 s5 s6 - slot)
(:init
    (handempty) (gridempty)
    (unused b1) (unused b2) (unused b3) (unused b4) (unused b5) (unused b6)
    (empty s1) (empty s2) (empty s3) (empty s4) (empty s5) (empty s6)
    (north s3 s1) (east s4 s1) (northeast s5 s3) 
    (northeast s6 s4) (north s2 s6) (east s2 s5)
    )
(:goal (and
    (filled s1) (filled s2) (filled s3) (filled s4) (filled s5) (filled s6)))
)
; (:init 
;     (north s3 s1) (east s4 s1) (northeast s5 s3) 
;     (northeast s6 s4) (north s2 s6) (east s2 s5)
;     (handempty) (gridempty)
;     (unused b1) (unused b2) (unused b3) (unused b4) (unused b5) (unused b6)
;     (empty s1) (empty s2) (empty s3) (empty s4) (empty s5) (empty s6))

; (:goal (and
;     (filled s1) (filled s2) (filled s3)
;     (filled s4) (filled s5) (filled s6))))

; plan
1. (pick-up b1)
   deleted: (handempty)
   added: (holding b1)
   goals met: 0 of 6
2. (place-first b1 s5)
   deleted: (gridempty) (unused b1) (empty s5) (holding b1)
   added: (filled s5) (handempty) (in b1 s5)
   goals met: 1 of 6
3. (pick-up b4)
   deleted: (handempty)
   added: (holding b4)
   goals met: 1 of 6
4. (place-east b4 b1 s2 s5)
   deleted: (holding b4) (unused b4) (empty s2)
   added: (handempty) (filled s2) (in b4 s2)
   goals met: 2 of 6
5. (pick-up b5)
   deleted: (handempty)
   added: (holding b5)
   goals met: 2 of 6
6. (place-south b5 b4 s6 s2)
   deleted: (holding b5) (unused b5) (empty s6)
   added: (handempty) (filled s6) (in b5 s6)
   goals met: 3 of 6
7. (pick-up b2)
   deleted: (handempty)
   added: (holding b2)
   goals met: 3 of 6
8. (place-southwest b2 b1 s3 s5)
   deleted: (holding b2) (unused b2) (empty s3)
   added: (handempty) (filled s3) (in b2 s3)
   goals met: 4 of 6
9. (pick-up b3)
   deleted: (handempty)
   added: (holding b3)
   goals met: 4 of 6
10. (place-south b3 b2 s1 s3)
   deleted: (holding b3) (unused b3) (empty s1)
   added: (handempty) (filled s1) (in b3 s1)
   goals met: 5 of 6
11. (pick-up b6)
   deleted: (handempty)
   added: (holding b6)
   goals met: 5 of 6
12. (place-east b6 b3 s4 s1)
   deleted: (holding b6) (unused b6) (empty s4)
   added: (handempty) (filled s4) (in b6 s4)
   goals met: 6 of 6
